app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "facebook_id", "google_id", "twitter_id", "updated_at") VALUES (?, ?, ?, ?, ?)